-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 26, 2022 at 12:47 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `cms`
--

-- --------------------------------------------------------

--
-- Table structure for table `articles`
--

CREATE TABLE `articles` (
  `id` int(11) NOT NULL,
  `title` varchar(150) NOT NULL,
  `text` text NOT NULL,
  `category` int(11) NOT NULL,
  `image` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `articles`
--

INSERT INTO `articles` (`id`, `title`, `text`, `category`, `image`) VALUES
(17, 'ناسا فضاپیمای دارت را به سیارک دیمورفوس کوبید و جهان پخش زنده آن را تماشا کرد', 'دایناسورها توانایی دفاع از خود دربرابر سیارک چیکسولوب را نداشتند؛ اما بشر اکنون درحال آغاز عصر تازه‌ای است که با ورود به آن می‌تواند سیارک‌های تهدیدزا برای زمین را منحرف کند.\r\nبامداد امروز به وقت ایران، ناسا در اتفاقی هیجان‌انگیز و بی‌سابقه، برخورد فضاپیمای دارت به سیارک دیمورفوس را از فاصله تقریباً ۱۱ میلیون کیلومتری به‌طور زنده پخش کرد. دارت (مخفف تغییر مسیر سیارک دوگانه) در ساعت ۲:۴۴ صبح سه‌شنبه خود را به سطح دیمورفوس کوبید تا مدار این سنگ فضایی کوچک به دور سیارکی دیگر به نام دیدیموس را به‌طور جزئی تغییر دهد.\r\n\r\nیک ساعت پیش از برخورد، سیارک هدف با نام دیمورفوس حتی در تصاویر فضاپیما مشاهده‌پذیر نبود. در برخی از تصاویر اولیه ارسال‌شده به زمین، حتی دیدیموس، سیارک بزرگ‌تر همراه دیمورفوس مانند ذره‌ای درمقابل دریایی سیاه به‌نظر می‌آمد. بااین‌حال فضاپیمای دارت با سرعت بیش از ۲۲ هزار کیلومتر بر ساعت حرکت می‌کرد و جزئیات به سرعت پدیدار شد. با پرواز خودکار فضاپیما به سمت دیمورفوس، تماشاگران روی زمین سطح سنگلاخی و ناهموار دیدیموس را مشاهده کردند. پیش از آنکه صفحه به نشانه ازدست‌رفتن سیگنال قرمز شود، تخته‌سنگ‌ها کل صفحه را پر کردند و دارت به مقصد نهایی خود رسید.\r\n\r\nدر اتاق عملیات، از راه رسیدن تصاویر سیارک موجب شگفتی اعضای تیم مأموریت شد. النا آدامز، مهندس سامانه‌های مأموریت دارت به نقل از ورج گفت: «برای نخستین‌بار بود که این سیارک به میدان دید ما وارد می‌شد. واقعاً نمی‌دانستیم چه انتظاری داشته باشیم. ما واقعاً از شکل سیارک آگاه نبودیم؛ اما می‌دانستیم که قرار است به کجا برخورد کنیم. درنتیجه فکر می‌کنم همگی ما به نوعی نفسمان را در سینه حبس کرده بودیم. یک جورهایی از اینکه هیچ کداممان واقعاً از هوش نرفتیم، تعجب کردم.»\r\n\r\nتلسکوپ‌های سرتاسر جهان و تعداد کمی در فضا، اکنون توجه خود را به صحنه برخورد معطوف کرده‌اند. آن‌ها تلاش می‌کنند تا دریابند که برخورد دارت با دیمورفوس تا چه حد بر حرکت این سیارک تأثیر گذاشته است. این تصادم عمدی بخشی از نخستین آزمایش عملی دفاع سیاره‌ای بود تا بفهمیم آیا بشر می‌تواند روزی مسیر سیارکی را که به سمت سیاره ما حرکت می‌کند، تغییر دهد یا خیر.', 8, 'articleImages/ناسا فضاپیمای دارت را به سیارک دیمورفوس کوبید و جهان پخش زنده آن را تماشا کرد/dart-s-view-of-dimorphos.jpg'),
(18, ' نقش آفرینی اما استون، ویلم دفو و مارگارت کوالی در فیلم جدید یورگوس لانتیموس', 'اما استون، ویلم دفو و مارگارت کوالی قرار است در همکاری دوباره با یورگوس لانتیموس در فیلم جدید این کارگردان با نام And بازی کنند.\r\n\r\nدر جدیدترین اخبار سینما و تلویزیون، یورگوس لانتیموس، کارگردان یونانی آثاری چون فیلم The Lobster، فیلم The Killing of a Sacred Deer و فیلم The Favourite در حال ساخت فیلم جدیدی است. طبق اطلاعات منتشر شده، اما استون، جسی پلمونس، ویلم دفو و مارگارت کوالی قرار است در فیلم جدید لانتیموس که قرار است And نام داشته باشد، به ایفای نقش بپردازند. این فیلم با همکاری سرچلایت پیکچرز، المنت پیکچرز و Film4 ساخته و اکران خواهد شد.\r\n\r\nیورگوس لانتیموس اخیرا فیلم Poor Things را کارگردانی کرده است که در این فیلم اما استون، ویلم دفو و مارگارت کوالی نیز حضور دارند و علاوه‌براین فیلم، استون با لانتیموس در فیلم The Favourite نیز همکاری داشته و برای بازی در این فیلم نامزد دریافت جایزه اسکار شده است. فیلم Poor Things که در آن شاهد بازیگران سرشناس دیگری مثل مارک رافلو و رامی یوسف نیز هستیم، قرار است در سال ۲۰۲۲ یا ۲۰۲۳ اکران شود.\r\n\r\nاطلاعاتی از داستان و اتفاقات فیلم AND در دسترس نیست و مراحل فیلم‌برداری و تولید این فیلم قرار است از ماه اکتبر (مهر یا آبان) در نیواورلئان آغاز خواهد شد که می‌توان انتظار داشت در اواخر سال ۲۰۲۳ یا سال ۲۰۲۴ اکران شود. لانتیموس پیش از این سه‌بار نامزد دریافت جایزه اسکار شده که این نامزدی‌ها شامل نامزد دریافت جایزه بهترین فیلمنامه اورجینال برای فیلم The Lobster، بهترین کارگردانی و بهترین فیلم سال برای فیلم The Favourite می‌شود که البته در هر سه مورد در رسیدن به این جایزه ناکام بوده است.', 5, 'articleImages/ نقش آفرینی اما استون، ویلم دفو و مارگارت کوالی در فیلم جدید یورگوس لانتیموس/emma-stone-willem-dafoe.jpg'),
(20, ' بازخوردهای منفی بازی FIFA 23 در استیم', 'به نظر می‌رسد که نسخه‌ی کامپیوتر FIFA 23 با مشکلات متعددی همراه بوده است.\r\n\r\nبازی FIFA 23 امروز به‌صورت رسمی در سراسر جهان منتشر شد. بااین‌حال، دارندگان نسخه‌ی Ultimate Edition و مشترکین سرویس EA Play، از چند روز قبل امکان تجربه‌ی بازی را به‌دست آوردند. به نظر می‌رسد گیمرهایی که در چند روز گذشته به تجربه‌ی FIFA 23 پرداختند، نظرات چندان خوشایندی در مورد جدیدترین بازی این مجموعه ندارند. در زمان نوشتن این خبر، حدود ۱۵۰۰ نظر مختلف در استیم به ثبت رسیده است و بیشتر بازخوردها تا به اینجای کار منفی هستند.\r\n\r\nدو مشکل در بیشتر گزارش‌ها قابل مشاهده است. مشکل اول، عدم اجرای بازی با نرم‌افزار Anti-Cheat است. باید به این نکته اشاره کنیم که برای تجربه‌ی FIFA 23 روی کامپیوتر، باید نرم‌افزار Anti-Cheat یا «ضد تقلب» را قبل از بازی اجرا کنید.\r\n\r\nالکترونیک آرتز، در پاسخ سریع به این مشکل علاوه‌بر ارائه‌ی یک سری راه‌حل اعلام کرد که در حال بررسی و رفع آن است. اولین راه‌حل، اجرای نرم‌افزار Origin یا EA به‌صورت Administrator است. در صورتی که این راه‌حل پاسخگو نبود، می‌توانید آنتی‌ویروس خودتان را خاموش کنید. چون به‌طور معمول، بسیاری از نرم‌افزارهای ضد تقلب به‌عنوان یک ویروس در سیستم شناخته می‌شوند. در همین راستا، در بسیاری از گزارش‌ها اعلام شده که با خاموش کردن Real Time Protection از قسمت Windows Defender مشکل آن‌ها رفع شده است. همچنین یک سری گزارش‌های دیگر اعلام کردند که احتمال خرابی فایل‌های آنتی چیت وجود دارد. به همین خاطر، بهتر است که در ابتدا یک بار آن را حذف و دوباره نصب کنید.\r\n\r\nدیگر مشکل FIFA 23 (فیفا ۲۳) روی کامپیوتر، کرش کردن بازی و همینطور نمایش یک پیام با عنوان \"Unrecoverable Error\" به معنای «ارور غیرقابل بازیابی» است. رفع این مشکل احتمالا کمی بیشتر طول بکشد. بااین‌حال، الکترونیک آرتز اعلام کرده که آن‌ها در حال بررسی این مشکل هستند.\r\n\r\nFIFA 23، آخرین بازی این مجموعه است که با نام «فیفا» منتشر می‌شود و از سال آینده شبیه‌ساز فوتبالی الکترونیک آرتز تحت عنوان EA Sports FC دردسترس کاربران قرار خواهد گرفت.', 9, 'articleImages/ بازخوردهای منفی بازی FIFA 23 در استیم/fifa-23-image-1.jpg'),
(21, 'مایکروسافت به‌روزرسانی ۲۰۲۲ ویندوز ۱۱ را به‌دلیل مشکل چاپگر روی برخی رایانه‌ها مسدود کرد', 'مایکروسافت هفته‌ی گذشته به‌رورزسانی ۲۰۲۲ ویندوز ۱۱ (که با نام 22H2 نیز شناخته می‌شود) را منتشر کرد. این آپدیت درحال‌حاضر باید برای بیشتر دستگاه‌هایی که ازقبل این سیستم‌عامل را اجرا می‌کنند دردسترس باشد. طبق‌معمول، در دستگاه‌های خاص برخی موارد حفاظتی وجود دارد که می‌تواند مشکلاتی در عملکرد آن ایجاد کند. غول فناوری مستقر در ردموند اکنون یک مشکل جدید را در این به‌روزرسانی تأیید کرده است که می‌تواند از کارکرد صحیح برخی چاپ‌گرها جلوگیری کند.\r\n\r\nبه‌گفته‌ی مایکروسافت، برخی از رایانه‌های شخصی احتمالاً با چاپگرهایی که از درایور کلاس IPP مایکروسافت یا درایور کلاس چاپ جهانی بهره می‌برند دچار مشکل خواهند شد. این چاپگرها برای شناسایی مجموعه‌ی کامل تنظیماتی که ارائه می‌دهند به اتصال نیاز دارند و اگر آن‌ها را بدون اتصال راه‌اندازی کنید، فقط امکان استفاده از تنظیمات پیش‌فرض را ارائه می‌دهند و در این شرایط بسیاری از ویژگی‌های این دستگاه‌ها مثل امکان چاپ رنگی، چاپ دوطرفه و تنظیمات سفارشی دیگر احتمالاً دردسترس نخواهد بود. بدین‌ترتیب مشکل مذکور چاپگرها را بی‌فایده خواهد کرد و به‌همین‌دلیل این مورد یک مشکل اساسی محسوب می‌شود.\r\n\r\nمایکروسافت می‌گوید درحال‌کار روی به‌روزرسانی جدیدی است تا مشکل چاپگرها را در ویندوز ۱۱ برطرف کند اما تا آن زمان، انتشار آپدیت ۲۰۲۲ این سیستم‌عامل برای رایانه‌هایی که از درایورهای فوق استفاده می‌کنند، متوقف شده است. به گزارش XDA، اگر از چاپگرهای مبتنی‌بر این درایورها استفاده می‌کنید و قصد دارید ویندوز ۱۱ خود را به جدیدترین نسخه‌ی آن به‌روزرسانی کنید، باید ابتدا درایورهای چاپگر را از کامپیوتر خود حذف کنید و پس‌از آن با گذشت ۴۸ ساعت، آپدیت جدید در بخش به‌روزرسانی ویندوز شما نمایان خواهد شد.\r\n\r\nاگر قبلاً به‌روزرسانی ۲۰۲۲ ویندوز ۱۱ را نصب کرده‌اید و با مشکلاتی که در بالا اشاره شد مواجه هستید، توصیه‌ی مایکروسافت این است که با حذف درایورهای چاپگر و نصب مجدد آن‌ها، مشکل را برطرف کنید. این اقدام به شما اجازه می‌دهد بتوانید از چاپگر خود به‌طور عادی استفاده کنید. این شرکت همچنین به کاربران هشدار داده است که از ابزارهایی مثل دستیار به‌روزرسانی ویندوز ۱۱ برای ارتقای اجباری به نسخه‌ی 22H2 استفاده نکنند زیرا در این‌شرایط اگرچه امکان دارد آپدیت روی رایانه‌ی شما نصب شود، اما می‌تواند مشکلاتی در عملکرد دستگاه ایجاد کند که رفع آن‌ها کمی طول خواهد کشید.\r\n\r\nشایان‌ذکر است اوایل ماه جاری شاهد انتشار به‌روزرسانی جدیدی برای ویندوز ۱۱ بودیم که مشکل ازکار افتادن چاپگرهای USB پس از راه‌اندازی مجدداً آن‌ها را برطرف کرد. بااین‌حال، مشکل اخیر در کارکرد چاپگرها روی این سیستم‌عامل، یک مورد کاملاً مجزا است.', 4, 'articleImages/مایکروسافت به‌روزرسانی ۲۰۲۲ ویندوز ۱۱ را به‌دلیل مشکل چاپگر روی برخی رایانه‌ها مسدود کرد/microsoft-surface-laptop-studio-start-menu.jpg'),
(22, 'رکوردشکنی هری کین با گلزنی در دربی لندن', ' هری کین امروز در دربی شمال لندن بین تاتنهام و آرسنال، گل مساوی تیمش را زد و توانست رکورد جدیدی به نام خودش ثبت کند. \r\n\r\nبه گزارش \"ورزش سه\"، نیمه اول دربی شمال لندن بین آرسنال و تاتنهام با تساوی 1-1 به اتمام رسید. ابتدا آرسنال بود که در دقیقه 20 توسط توماس پارتی به گل رسید اما تاتنهام در دقیقه 31 از روی نقطه پنالتی توانست کار را مساوی کند. زننده گل نیز هری کین بود. \r\n\r\nبا همکاری سون هیونگ مین و کین، فرصت خوبی نصیب ریچارلیسون شد اما او توسط گابریل ماگلائش، مدافع آرسنال در درون محوطه جریمه میزبان سرنگون شد تا داور اعلام پنالتی کند. کین پشت توپ ایستاد و با این گل توانست به اولین بازیکن تاریخ لیگ برتر انگلیس تبدیل شود که به رکورد 100 گل در زمین حریفان می رسد. این همچنین گل شماره 14 او در دربی شمال لندن نیز بود. تعداد گل های کین در لیگ برتر نیز به 190 رسید و او تنها آلن شیرر(260 گل) و وین رونی(208) را بالاتر از خود می بیند. ', 2, 'articleImages/رکوردشکنی هری کین با گلزنی در دربی لندن/2o42pcr0.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `title` varchar(75) NOT NULL,
  `status` enum('0','1') NOT NULL,
  `chid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `title`, `status`, `chid`) VALUES
(1, 'اخبار', '1', 0),
(2, 'اخبار ورزشی', '1', 1),
(4, 'اخبار تکنولوژی', '1', 1),
(5, 'اخبار سینما', '1', 1),
(7, 'اخبار فرهنگی', '0', 1),
(8, 'اخبار علمی', '1', 1),
(9, 'اخبار بازی', '1', 1),
(10, 'مقالات', '1', 0),
(11, 'ویدیوها', '0', 0),
(12, 'مقاله علمی', '1', 10),
(13, 'مقاله تکنولوژی', '1', 10),
(14, 'مقاله گردشگری', '0', 10);

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `user_id`, `text`, `time`) VALUES
(1, 1, 'این یک کامنت تست توسط کاربر تست است.', '2022-10-26 10:46:12'),
(2, 3, 'این یک کامنت تست توسط کاربر علیرضا است.', '2022-10-26 10:46:12'),
(3, 4, 'این یک کامنت تست توسط کاربر مهسا است.', '2022-10-26 10:46:12');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(25) NOT NULL,
  `lastname` varchar(35) NOT NULL,
  `email` varchar(100) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(150) NOT NULL,
  `age` int(11) NOT NULL DEFAULT 0,
  `gender` varchar(10) NOT NULL,
  `image` text DEFAULT NULL,
  `joined_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `lastname`, `email`, `username`, `password`, `age`, `gender`, `image`, `joined_at`) VALUES
(1, 'تست', 'نام خانوادگی تست', 'test@gmail.com', 'test', '1', 18, 'آقا', 'images/test@gmail.com/78-786293_1240-x-1240-0-avatar-profile-icon-png.png', '2022-09-01 06:18:21'),
(3, 'علیرضا', 'نیک اندیش', 'alireza@email.com', 'alireza', 'alireza12345', 23, 'آقا', 'images/alireza@email.com/258-2582267_circled-user-male-skin-type-1-2-icon-male-user-icon.png', '2022-09-09 16:22:06'),
(4, 'مهسا', 'اسکندری', 'mahsa@yahoo.com', 'mahsa', 'mahsa12345', 26, 'خانم', 'images/mahsa@yahoo.com/female+person+user+woman+young+icon-1320196266256009072.png', '2022-09-09 16:36:56'),
(5, 'پیروز', 'پیروزی', 'pirouz@yahoo.com', 'pirouz', 'pirouz1234', 28, 'آقا', 'images/pirouz@yahoo.com/man.png', '2022-10-03 18:12:58'),
(6, 'منصور', 'شوکت', 'mansourshokat@gmail.com', 'mansour', 'mansour123456', 18, 'آقا', 'images/mansourshokat@gmail.com/images.png', '2022-10-04 10:45:28');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `articles`
--
ALTER TABLE `articles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_comments` (`user_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `password` (`password`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `articles`
--
ALTER TABLE `articles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `fk_comments` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
